# Table of Contents:
Note.- This only works in VS Studio. For Github see Readme TOC.

TOC --> 
- [Sprint 6 Task 1: Task data, probabilities and statistics](#sprint-6-task-1--task-data--probabilities-and-statistics)
- [Description](#description)
- [Level 1](#level-1)
    - [Exercise 1](#exercise-1)
    - [Exercise 2](#exercise-2)
- [Level 2](#level-2)
    - [Exercise 3](#exercise-3)
- [Level 3](#level-2)
    - [Exercise 4](#exercise-2)
<!-- /TOC

# Sprint 6 Task 1: Task data, probabilities and statistics

## Description
Learn how to perform statistics with Python.

Level 1
- Exercise 1.
Take a sports-themed data set that you like and select an attribute from the data set.  Calculate the mode, mean, standard deviation and arithmetic mean. 

- Exercise 2
Continuing with the sports-themed data, select two attributes and calculate their correlation. 

Level 2
- Exercise 3
Continuing with the sports-themed data, calculate the correlation of all attributes with each other and represent them in a matrix with different colors of intensity.

Level 3
- Exercise 4
Continuing with the sports-themed data, select an attribute and calculate the geometric median and the harmonic median.

In [111]:
# Import Libraries
import numpy as np
import pandas as pd

In [112]:
import warnings
# warnings.filterwarnings('ignore')
warnings.filterwarnings("default")

## Level 1
### Exercise 1
Take a sports-themed data set that you like and select an attribute from the data set.  Calculate the mode, mean, standard deviation and arithmetic mean.

We will take the following dataset from Kaggle:
Data scientist salary: ðŸ—¨ï¸ https://www.kaggle.com/nikhilbhathi/data-scientist-salary-us-glassdoor

In [113]:
df = pd.read_csv('./data_cleaned_2021.csv')
df

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist â€“ Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [114]:
# Let's pre-explore the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742 entries, 0 to 741
Data columns (total 42 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   index               742 non-null    int64
 1   Job Title           742 non-null    object
 2   Salary Estimate     742 non-null    object
 3   Job Description     742 non-null    object
 4   Rating              742 non-null    float64
 5   Company Name        742 non-null    object
 6   Location            742 non-null    object
 7   Headquarters        742 non-null    object
 8   Size                742 non-null    object
 9   Founded             742 non-null    int64
 10  Type of ownership   742 non-null    object
 11  Industry            742 non-null    object
 12  Sector              742 non-null    object
 13  Revenue             742 non-null    object
 14  Competitors         742 non-null    object
 15  Hourly              742 non-null    int64
 16  Employer provided   742 non-null    int64
 17  Lower Salary        742 non-null    int64
 18  Upper Salary        742 non-null    int64
 19  Avg Salary(K)       742 non-null    float64
 20  company_txt         742 non-null    object
 21  Job Location        742 non-null    object
 22  Age                 742 non-null    int64
 23  Python              742 non-null    int64
 24  spark               742 non-null    int64
 25  aws                 742 non-null    int64
 26  excel               742 non-null    int64
 27  sql                 742 non-null    int64
 28  sas                 742 non-null    int64
 29  keras               742 non-null    int64
 30  pytorch             742 non-null    int64
 31  scikit              742 non-null    int64
 32  tensor              742 non-null    int64
 33  hadoop              742 non-null    int64
 34  tableau             742 non-null    int64
 35  bi                  742 non-null    int64
 36  flink               742 non-null    int64
 37  mongo               742 non-null    int64
 38  google_an           742 non-null    int64
 39  job_title_sim       742 non-null    object
 40  seniority_by_title  742 non-null    object
 41  Degree              742 non-null    object
dtypes: float64(2), int64(23), object(17)
memory usage: 243.6+ KB

In [115]:
# Let's pre-explore the dataset
round(df.describe())

,index,Rating,Founded,Hourly,Employer provided,Lower Salary,Upper Salary,Avg Salary(K),Age,Python,...,keras,pytorch,scikit,tensor,hadoop,tableau,bi,flink,mongo,google_an
count,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,...,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0
mean,469.0,4.0,1837.0,0.0,0.0,75.0,128.0,101.0,48.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
std,280.0,1.0,497.0,0.0,0.0,31.0,45.0,37.0,54.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
min,0.0,-1.0,-1.0,0.0,0.0,15.0,16.0,16.0,-1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
25%,222.0,3.0,1939.0,0.0,0.0,52.0,96.0,74.0,12.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
50%,472.0,4.0,1988.0,0.0,0.0,70.0,124.0,98.0,25.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
75%,708.0,4.0,2007.0,0.0,0.0,91.0,155.0,122.0,60.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
max,955.0,5.0,2019.0,1.0,1.0,202.0,306.0,254.0,277.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0

In [116]:
# Let's first clean our column's names:
df.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
       'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'Python',
       'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
       'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'Degree'],
      dtype='object')

In [117]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(" ","_")
df.columns = df.columns.str.replace(r'\(k\)',"_k", regex=True)
df.columns

Index(['index', 'job_title', 'salary_estimate', 'job_description', 'rating',
       'company_name', 'location', 'headquarters', 'size', 'founded',
       'type_of_ownership', 'industry', 'sector', 'revenue', 'competitors',
       'hourly', 'employer_provided', 'lower_salary', 'upper_salary',
       'avg_salary_k', 'company_txt', 'job_location', 'age', 'python', 'spark',
       'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit', 'tensor',
       'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'degree'],
      dtype='object')

In [118]:
# Let's now focus on average salary (column 'avg_salary_k') for same job_title (column 'job_title_sim') (our main interest in this dataset)
df_salary = df [['job_title_sim','avg_salary_k']]
df_salary

       job_title_sim  avg_salary_k
0     data scientist          72.0
1     data scientist          87.5
2     data scientist          85.0
3     data scientist          76.5
4     data scientist         114.5
..               ...           ...
737  other scientist          84.5
738    data engineer         102.5
739  other scientist          73.5
740   data scientist         127.5
741  other scientist          93.5

[742 rows x 2 columns]

In [119]:
# let's explore the values on job_titles:
df_salary.job_title_sim.value_counts()

data scientist                    313
other scientist                   143
data engineer                     119
analyst                           101
machine learning engineer          22
Data scientist project manager     16
na                                 10
data analitics                      8
data modeler                        5
director                            5
Name: job_title_sim, dtype: int64

In [120]:
avg_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.mean()
print('The average salary (mean) of a data scientist in US is: ',round(avg_salary*1000),'$')

The average salary (mean) of a data scientist in US is:  118294 $

Let's now calculate mode, standard deviation and arithmetic mean.

In [121]:
median_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.median()
print('The median salary of a data scientist in US is: ',round(median_salary*1000),'$')

The median salary of a data scientist in US is:  113500 $

In [122]:
std_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.std()
print('The standard deviation in salary of a data scientist in US in this dataset is: ',round(std_salary*1000),'$')

The standard deviation in salary of a data scientist in US in this dataset is:  35864 $

In [123]:
## To finish and study some theory...
mode_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.mode()
print('The mode salary of a data scientist in US is: ',round(mode_salary*1000),'$')

The mode salary of a data scientist in US is:  0     85000.0
1    107000.0
dtype: float64 $

### - Exercise 2
Continuing with the sports-themed data, select two attributes and calculate their correlation.


## Level 2
### - Exercise 3
Continuing with the sports-themed data, calculate the correlation of all attributes with each other and represent them in a matrix with different colors of intensity.


## Level 3
### - Exercise 4
Continuing with the sports-themed data, select an attribute and calculate the geometric median and the harmonic median.